app/controllers/api/v1/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "name" = $1, "photo" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Demetrice Wolf"], ["photo", "file.png"], ["updated_at", 2017-02-02 04:22:09 UTC], ["id", 6]]

  def set_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "andera@kerlukerice.info"], ["LIMIT", 1]]